nuclei-v3/S/sap-abapreadsyslog-disclosure.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - <item>
    - <Time>
    - <Text>
    - ABAPReadSyslogResponse
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:ABAPReadSyslog xmlns:ns1=\"urn:SAPControl\"></ns1:ABAPReadSyslog>\n\
    \  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n"
id: sap-abapreadsyslog-disclosure
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAPControl SOAP web service exposes
    the ABAPReadSyslog operation without authentication. ABAPReadSyslog returns the
    ABAP system log (equivalent to transaction SM21) via SAPControl sapstartsrv and
    includes fields such as client, username, transaction code, message number, free-text
    message and severity.

    '
  metadata:
    max-request: 1
  name: SAPControl ABAPReadSyslog - Disclosure
  reference:
  - https://my-handshake.blogspot.com/2011/03/sapcontrol-webmethods-list.html
  - https://gist.github.com/c6da760f57e062397e52400936ca5797
  - https://exchange.icinga.com/kai_ks/check_sap_hostctrl
  severity: medium
  tags: misconfig,sap,sapcontrol,soap,log,disclosure
